app/Http/Controllers/LikesPlaylistController.php

    public function loadPlaylistLike()
    {
        //Like数とLike有無フラグを格納する配列を宣言
        $playlistLike = [];

        //全タグIDを取得
        $likes = LikesPlaylist::all();
---
select * from `likes_playlists`

    public function getLikeCountById($playlist_id)
    {
        $like = LikesPlaylist::where('playlist_id', $playlist_id)->get();
---
select * from `likes_playlists` where `playlist_id` = 20

    public function checkLiked($user_id, $playlist_id)
    {
        $like = LikesPlaylist::where('user_id', $user_id)->where('playlist_id', $playlist_id)->get();
---
select * from `likes_playlists` where `user_id` = 1 and `playlist_id` = 20