app/Http/Controllers/PlaylistController.php

select * from `likes_playlists` where `user_id` = 1
select `playlists`.*, (select count(*) from `playlistlogs` where `playlists`.`id` = `playlistlogs`.`playlist_id`) as `play_count` from `playlists` where `playlists`.`id` in (20)
---
    public function likedPlaylist()
    {
        if (Auth::user()) {
            $likesPlaylists = LikesPlaylist::where('user_id', Auth::user()->id)->get();
            $likesPlaylistIds = [];
            foreach ($likesPlaylists as $likesPlaylist) {
                $likesPlaylistIds[] = $likesPlaylist->playlist_id;
            }

            $myLikedPlaylists = Playlist::with('tags')->withCount(['playlistlogs as play_count'])->find($likesPlaylistIds);

select `playlists`.*, (select count(*) from `playlistlogs` where `playlists`.`id` = `playlistlogs`.`playlist_id`) as `play_count` from `playlists` where `user_id` = 1
---
    public function createdPlaylist()
    {
        if (Auth::user()) {
            $createdPlaylist = Playlist::with('tags')->withCount(['playlistlogs as play_count'])->where('user_id', Auth::user()->id)->get();