app/Http/Controllers/SearchController.php

    public function getSearchCandidates(Request $request)
    {
        $input = $request->input;
        $searchOption = $request->searchOption;

        //人気の検索キーワードからサジェストを取得
        $topSearchqueriesCandidates = Topsearchquery::whereIn('searchquery_id', function ($query) use ($input, $searchOption) {
            $query->from('searchqueries')->where('searchQuery', 'LIKE', "%$input%")->where('searchOption', $searchOption)->select('id')->get();
        })->with('searchquery')->orderBy('user_id_count', 'desc')->get();
---
select * from `searchqueries` where `searchqueries`.`id` in (7, 16)
select * from `topsearchqueries` where `searchquery_id` in (select `id` from `searchqueries` where `searchQuery` LIKE '%tes%' and `searchOption` = 1) order by `user_id_count` desc
select `id` from `searchqueries` where `searchQuery` LIKE '%tes%' and `searchOption` = 1

    public function storeSearchQuery($searchQuery, $searchOption)
    {
        $searchquery = Searchquery::where('searchQuery', $searchQuery)->where('searchOption', $searchOption);
        if ($searchquery->get()->isEmpty()) {
            //新規に作成する場合
            $searchquery = new Searchquery;
            $searchquery->searchQuery = $searchQuery;
            $searchquery->searchOption = $searchOption;
            $searchquery->save();
            return $searchquery;
        } else {
            //既に検索クエリがテーブルに存在する場合
            $searchquery->update([
                'updated_at' => Carbon::now()
            ]);
            return $searchquery->first();
---
select * from `searchqueries` where `searchQuery` = 'soccer' and `searchOption` = 1
update `searchqueries` set `searchqueries`.`updated_at` = '2020-10-07 12:39:12' where `searchQuery` = 'soccer' and `searchOption` = 1
select * from `searchqueries` where `searchQuery` = 'soccer' and `searchOption` = 1 limit 1

    public function updateTopSearchqueries($searchOption)
    {
        $topSearchqueries = [];

        //直近一ヶ月の検索クエリを取得
        $recentSearchqueries = Searchquery::where('created_at', '>=', Carbon::now()->subMonthNoOverflow())->where('searchOption', $searchOption)->get();

        //各検索クエリのユニークユーザー数を取得
        foreach ($recentSearchqueries as $recentSearchquery) {
            $user_id_count = SearchqueryUser::where('searchquery_id', $recentSearchquery->id)->distinct()->count('user_id');
            $topSearchqueries[] = [
                'searchquery_id' => $recentSearchquery->id,
                'user_id_count' => $user_id_count,
                'searchOption' => $recentSearchquery->searchOption
            ];
        }

        //TopSearchqueriesテーブルをクリア
        Topsearchquery::where('searchOption', $searchOption)->delete();

        //TopSearchqueriesテーブルに格納
        foreach ($topSearchqueries as $topSearchquery) {
            $record = new Topsearchquery;
            $record->searchquery_id = $topSearchquery['searchquery_id'];
            $record->user_id_count = $topSearchquery['user_id_count'];
            $record->searchOption = $topSearchquery['searchOption'];
            $record->save();
---
select * from `searchqueries` where `created_at` >= '2020-09-07 12:39:12' and `searchOption` = 1
select count(distinct `user_id`) as aggregate from `searchquery_user` where `searchquery_id` = 1
delete from `topsearchqueries` where `searchOption` = 1
insert into `topsearchqueries` (`searchquery_id`, `user_id_count`, `searchOption`, `updated_at`, `created_at`) values (1, 0, 1, '2020-10-07 12:39:12', '2020-10-07 12:39:12')