app/Http/Controllers/TagController.php

    public function getTagByVideoId(Request $request)
    {
        $videoId = $request->videoId;
        $tag = Tag::where('video_id', $videoId)->get();
---
select * from `tags` where `video_id` = '33'

    public function loadMyCreatedAndLikedTagVideo()
    {
        //LikeしたタグIDを取得
        if (Auth::user()) {
            $likes = Like::where('user_id', Auth::user()->id)->get();
            $likesIds = [];
            foreach ($likes as $like) {
                $likesIds[] = $like->tag_id;
            }
            // DB::enableQueryLog();
            // Likeしたタグデータと作成したタグデータを取得
            $myCreatedAndLikedTagVideo = Tag::whereIn('tags.id', $likesIds)->orWhere('tags.user_id', Auth::user()->id)->leftJoin('videos', 'videos.id', '=', 'tags.video_id')->select('videos.id as video_id', 'youtubeId', 'videos.user_id', 'title', 'thumbnail', 'duration', 'channel_title', 'published_at', 'view_count', 'videos.created_at as video_created_at', 'videos.updated_at as video_updated_at', 'tags.id as tag_id', 'tags', 'start', 'end', 'preview', 'previewgif', 'tags.created_at as tag_created_at', 'tags.updated_at as tag_updated_at')->orderBy('tag_created_at', 'desc')->get();
---
select `videos`.`id` as `video_id`, `youtubeId`, `videos`.`user_id`, `title`, `thumbnail`, `duration`, `channel_title`, `published_at`, `view_count`, `videos`.`created_at` as `video_created_at`, `videos`.`updated_at` as `video_updated_at`, `tags`.`id` as `tag_id`, `tags`, `start`, `end`, `preview`, `previewgif`, `tags`.`created_at` as `tag_created_at`, `tags`.`updated_at` as `tag_updated_at` from `tags` left join `videos` on `videos`.`id` = `tags`.`video_id` where `tags`.`id` in (6, 10, 16) or `tags`.`user_id` = 1 order by `tag_created_at` desc

    public function store(Request $request)
    {
        if (Auth::user()) {
            if (Video::where('youtubeId', $request->youtubeId)->exists()) {
                //既存YouTube動画の場合、テーブルからVideoオブジェクトを取得
                $video = Video::where('youtubeId', $request->youtubeId)->first();
                $video->view_count = $request->newVideoData['view_count'];
                $video->save();
            } else {
                //新規YouTube動画の場合、最初に動画をDBに保存
                $video = new Video;
                $video->youtubeId = $request->youtubeId;
                $video->user_id = Auth::user()->id;
                $video->title = $request->newVideoData['title'];
                $video->thumbnail = $request->newVideoData['thumbnail'];
                $video->duration = $request->newVideoData['duration'];
                $video->category = $request->newVideoData['category'];
                $video->channel_title = $request->newVideoData['channel_title'];
                $video->published_at = $request->newVideoData['published_at'];
                $video->view_count = $request->newVideoData['view_count'];
                $video->save();
---
select exists(select * from `videos` where `youtubeId` = '4pN3o1wKhaU') as `exists`
select * from `videos` where `youtubeId` = '4pN3o1wKhaU' limit 1
insert into `videos` (`youtubeId`, `user_id`, `title`, `thumbnail`, `duration`, `category`, `channel_title`, `published_at`, `view_count`, `updated_at`, `created_at`) values ('ov1NcvzCLoE', 1, '練習試合　対ミナトユナイテッド５', 'https://i.ytimg.com/vi/ov1NcvzCLoE/hqdefault.jpg', '00:20:44', 'People & Blogs', '二宮一弘', '2020-09-26T13:35:53Z', '53', '2020-10-07 13:02:43', '2020-10-07 13:02:43')

            $tag->privacySetting = $request->privacySetting;
            $tag->preview = $previewThumbName;
            $tag->previewgif = $previewGifName;
            $tag->save();
---
insert into `tags` (`video_id`, `user_id`, `tags`, `start`, `end`, `privacySetting`, `preview`, `previewgif`, `updated_at`, `created_at`) values (34, 1, 'giftest', '00:0:24', '00:0:25', 'public', 'n80CYo5L8mQ-24-2086666138.png', 'n80CYo5L8mQ-24-719177597.gif', '2020-10-07 18:06:22', '2020-10-07 18:06:22')

    public function getTagHistories()
    {
        //ユーザーが登録した直近10件のシーンタグを取得
        if (Auth::user()) {
            $tags = Tag::where('user_id', Auth::user()->id)->orderBy('created_at', 'desc')->take(10)->get();
---
select * from `tags` where `user_id` = 1 order by `created_at` desc limit 10