app/Http/Controllers/VideoController.php

select * from `videos` where `youtubeId` = '4pN3o1wKhaU'
---
    public function getVideoByYoutubeId(Request $request)
    {
        $youtubeId = $request->youtubeId;
        $video = Video::where('youtubeId', $youtubeId)->get();

select * from `videos` where `user_id` = 1 order by `created_at` desc
---
    public function getYTRecentVideoList(Request $request)
    {
        if (Auth::check()) {
            $user_id = Auth::user()->id;
            $recentVideoList = Video::where('user_id', $user_id)->orderBy('created_at', 'DESC')->get();